{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.17.0", "signature": {"inputs": {"organic_carbon:0": {"name": "organic_carbon:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "unknown:0": {"name": "unknown:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 215407}, "solids:0": {"name": "solids:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "ph:0": {"name": "ph:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "trihalomethanes:0": {"name": "trihalomethanes:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "conductivity:0": {"name": "conductivity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "turbidity:0": {"name": "turbidity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "hardness:0": {"name": "hardness:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "sulfate:0": {"name": "sulfate:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}, "chloramines:0": {"name": "chloramines:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}]}}}, "outputs": {"output_1": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "chloramines", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conductivity", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "hardness", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "organic_carbon", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "ph", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "solids", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}]}}}}, {"name": "sulfate", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "trihalomethanes", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "turbidity", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Placeholder", "attr": {"shape": {"shape": {}}, "dtype": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12", "op": "NoOp", "input": ["^chloramines", "^conductivity", "^hardness", "^organic_carbon", "^solids", "^sulfate", "^trihalomethanes", "^turbidity", "^ph", "^unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/stack", "op": "Pack", "input": ["chloramines", "conductivity", "hardness", "organic_carbon", "solids", "sulfate", "trihalomethanes", "turbidity", "ph", "^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"axis": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "9"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{}, {}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}, {}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/values", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "op": "Const", "input": ["^Func/StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/input_control_node/_12"], "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/inference_op", "op": "SimpleMLInferenceOpWithHandle", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/stack", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const_1", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/values", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const_1", "unknown"], "attr": {"_has_manual_control_dependencies": {"b": true}, "dense_output_dim": {"i": "2"}}}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/inference_op", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "end_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "modelInitializer": {"node": [{"name": "Func/StatefulPartitionedCall/input_control_node/_0", "op": "NoOp", "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "215612", "op": "Const", "attr": {"_has_manual_control_dependencies": {"b": true}, "value": {"tensor": {"dtype": "DT_STRING", "tensorShape": {}}}, "dtype": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/input_control_node/_0"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "op": "SimpleMLCreateModelResource", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/input_control_node/_8"], "attr": {"_has_manual_control_dependencies": {"b": true}, "shared_name": {"s": "c2ltcGxlX21sX21vZGVsXzkwY2E2ZmNmLTJkNjUtNGIxNS05NTIwLTdmY2M4YmFhMmVmZl9sb2FkXzIxNTA5Nw=="}, "container": {"s": ""}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall/output_control_node/_2", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/StatefulPartitionedCall/Identity", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/SimpleMLCreateModelResource", "^StatefulPartitionedCall/StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "op": "Identity", "input": ["StatefulPartitionedCall/StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "StatefulPartitionedCall/NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/StatefulPartitionedCall/output_control_node/_10"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/StatefulPartitionedCall/output/_9", "^StatefulPartitionedCall/NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall/output/_1", "op": "Identity", "input": ["StatefulPartitionedCall/Identity"], "attr": {"T": {"type": "DT_RESOURCE"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input_control_node/_3", "op": "NoOp", "input": ["^215612", "^Func/StatefulPartitionedCall/output/_1"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/input/_5", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_5", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_RESOURCE"}}}, {"name": "Func/StatefulPartitionedCall_1/input/_4", "op": "Identity", "input": ["215612", "^Func/StatefulPartitionedCall_1/input_control_node/_3"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12", "op": "Identity", "input": ["Func/StatefulPartitionedCall_1/input/_4", "^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input_control_node/_11"], "attr": {"T": {"type": "DT_STRING"}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace", "op": "StaticRegexReplace", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_12"], "attr": {"rewrite": {"s": ""}, "pattern": {"s": "ZWUyM2E1MDQzY2RhNGY0ZWRvbmU="}, "replace_global": {"b": true}}}, {"name": "StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle", "op": "SimpleMLLoadModelFromPathWithHandle", "input": ["Func/StatefulPartitionedCall_1/StatefulPartitionedCall/input/_13", "StatefulPartitionedCall_1/StatefulPartitionedCall/StaticRegexReplace"], "attr": {"output_types": {"list": {}}, "_has_manual_control_dependencies": {"b": true}, "file_prefix": {"s": "ZWUyM2E1MDQzY2RhNGY0ZQ=="}, "allow_slow_inference": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15", "op": "NoOp", "input": ["^StatefulPartitionedCall_1/StatefulPartitionedCall/simple_ml/SimpleMLLoadModelFromPathWithHandle"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Func/StatefulPartitionedCall_1/output_control_node/_7", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall_1/StatefulPartitionedCall/output_control_node/_15"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "NoOp", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/output_control_node/_2", "^Func/StatefulPartitionedCall_1/output_control_node/_7"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "Identity", "op": "Identity", "input": ["Func/StatefulPartitionedCall/output/_1", "^Func/StatefulPartitionedCall_1/output_control_node/_7", "^NoOp"], "attr": {"T": {"type": "DT_RESOURCE"}}}], "versions": {"producer": 1766}}, "initializerSignature": {"outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_RESOURCE", "tensorShape": {}, "resourceId": 215407}}}, "weightsManifest": [{"paths": ["GB.bin"], "weights": [{"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const", "shape": [0, 0], "dtype": "float32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/Const_1", "shape": [0, 0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/values", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/RaggedConstant/Const_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_1", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/gradient_boosted_trees_model/StatefulPartitionedCall/PartitionedCall_1/strided_slice/stack_2", "shape": [2], "dtype": "int32"}, {"name": "215612", "shape": [], "dtype": "string"}]}]}